{
    "person": {
        "role": "AI Product Engineer @AvestaLabs.ai | Building Ingestiq.ai"
    },
    "contact": {
        "title": "Get in touch with me",
        "description": "Have a project in mind, want to collaborate, or just want to say hello? I'd love to hear from you! Fill out the form below and I'll get back to you as soon as possible.",
        "button": "Send Message"
    },
    "home": {
        "label": "Home",
        "title": "{name}'s Portfolio",
        "description": "AI Product Engineering @AvestaLabs.ai, Building Ingestiq.ai, an Agentic RAG Platform. Software Engineer with a product mindset.",
        "headline": "AI Product Engineering @AvestaLabs.ai",
        "subline": "I'm Dharmik, building Ingestiq.ai, an Agentic RAG Platform. Software Engineer specializing in Backend Development, AI Infrastructure, and Serverless Architecture. Passionate about building scalable, intelligent systems that bridge data engineering and applied AI."
    },
    "about": {
        "label": "About",
        "title": "About me",
        "description": "Meet {name}, {role} from Ahmedabad, Gujarat",
        "intro": {
            "title": "Introduction",
            "description": "I'm a Software Engineer specializing in Backend Development, AI Infrastructure, and Serverless Architecture. Passionate about building scalable, intelligent systems that bridge data engineering and applied AI. Currently at AvestaLabs, I've architected and contributed to multiple Generative AI, RAG, and data ingestion platforms, leveraging AWS (Lambda, Step Functions, S3, OpenSearch) and LLMs (OpenAI, Gemini) to power production-grade AI workflows. I recently co-led the development of Ingestiq.ai, a unified data ingestion and semantic search platform that transforms unstructured sources into AI-ready datasets using RAG, LLMs, and vector search."
        },
        "work": {
            "title": "Work Experience",
            "experiences": {
                "AvestaLabs.ai": {
                    "timeframe": "Jul 2025 - Present",
                    "role": "Software Engineer, Product & AI Engineering",
                    "achievements": "Architecting IngestIQ.ai, a production-grade RAG platform for ingesting, chunking, embedding, and semantic retrieval;Built event-driven ingestion pipelines and vector database indexing workflows;Integrated Model Context Protocol (MCP) for structured agent context;Implemented query embeddings and LLM-based semantic chunking to improve retrieval accuracy and contextual relevance across the RAG pipeline"
                },
                "AvestaHQ.com, Backend Software Engineer": {
                    "timeframe": "Apr 2025 - Jul 2025",
                    "role": "Backend Software Engineer",
                    "achievements": "Built serverless backend pipelines to process and migrate CSV and structured data to MySQL using AWS Lambda and Step Functions;Designed database schemas and implemented layered architecture with unit, integration, and E2E tests, ensuring reliable processing of thousands of records daily;Developed ETL workflows integrating MySQL and Elasticsearch for ingestion, transformation, and search indexing;Ensured production readiness, scalability, and observability through proper error handling, retry logic, logging, and TDD"
                },
                "AvestaHQ.com, Intern": {
                    "timeframe": "Jul 2024 - Apr 2025",
                    "role": "Software Engineer Intern",
                    "achievements": "Developed REST APIs using Node.js and Express.js following OOP and clean code practices;Worked with AWS, Elasticsearch, and MySQL for backend systems;Implemented unit, integration, and E2E tests for production readiness;Practiced Test-Driven Development (TDD)"
                }
            }
        },
        "studies": {
            "title": "Education",
            "institutions": {
                "Vishwakarma Government Engineering College": {
                    "description": "Bachelor of Engineering in Computer Engineering (CGPA: 8.37/10)"
                },
                "Shree Swaminarayan Gurukul, Taravada": {
                    "description": "12th Science (GSHEB) - 82.16% | 10th Standard (GSEB) - 94.17% | JEE Mains Score: 90.14%"
                }
            }
        },
        "technical": {
            "title": "Technical Skills",
            "skills": {
                "Backend": {
                    "description": "Node.js, TypeScript, Express.js"
                },
                "AI Systems": {
                    "description": "RAG, Agents, LLM Integration, Vector Databases"
                },
                "Cloud & Infra": {
                    "description": "AWS Lambda, Step Functions, S3, OpenSearch, PostgreSQL, MySQL"
                },
                "Architecture": {
                    "description": "Clean Architecture, Layered Design, TDD, Event-Driven Systems"
                },
                "Core CS": {
                    "description": "SDLC, Data Structures & Algorithms, Compilers"
                }
            }
        }
    },
    "blog": {
        "label": "Blog",
        "title": "Writing about backend engineering and system design...",
        "description": "Read what {name} has been up to recently"
    },
    "work": {
        "label": "Work",
        "title": "My projects",
        "description": "Backend and AI projects by {name}"
    },
    "helpfulStuff": {
        "label": "Helpful Stuff",
        "title": "Helpful Stuff",
        "description": "A collection of bookmarks, helpful videos, docs, crash courses, and more by {name}"
    },
    "projectCard": {
        "label": "View Project"
    }
}